lib/soap_actions/ProcessSplitPayTransaction.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://propay.com/SPS/contracts" xmlns:typ="http://propay.com/SPS/types"
xmlns:prop="http://schemas.datacontract.org/2004/07/Propay.Contracts.SPS.External">
<soapenv:Header/>
<soapenv:Body>
<con:ProcessSplitPayTransaction>
<con:id>
        <%= @partial %>
</con:id>
<con:request>
<typ:InitialTransaction>
<typ:Amount>?</typ:Amount>
<typ:Comment1>?</typ:Comment1>
<typ:Comment2>?</typ:Comment2>
<typ:CurrencyCode>?</typ:CurrencyCode>
<typ:Invoice>?</typ:Invoice>
<typ:OptionalOverrides>
<prop:CreditCard>
<prop:Billing>
<typ:Address1>?</typ:Address1>
<typ:Address2>?</typ:Address2>
<typ:Address3>?</typ:Address3>
<typ:City>?</typ:City>
<typ:Country>?</typ:Country>
<typ:State>?</typ:State>
<typ:ZipCode>?</typ:ZipCode>
</prop:Billing>
<prop:CVV>?</prop:CVV>
<prop:ExpirationDate>?</prop:ExpirationDate>
<prop:FullName>?</prop:FullName>
</prop:CreditCard>
</typ:OptionalOverrides>
<typ:PayerAccountId>?</typ:PayerAccountId>
<typ:PaymentMethodId>?</typ:PaymentMethodId>
</typ:InitialTransaction>
<typ:SecondaryTransaction>
<prop:Amount>?</prop:Amount>
<prop:OriginatingAccountId>?</prop:OriginatingAccountId>
<prop:ReceivingAccountId>?</prop:ReceivingAccountId>
</typ:SecondaryTransaction>
</con:request>
</con:ProcessSplitPayTransaction>
</soapenv:Body>
</soapenv:Envelope>
